#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aws-lambda-cost.aws_cloudwatch_event_rule.every-five-minutes will be created
  + resource "aws_cloudwatch_event_rule" "every-five-minutes" {
      + arn                 = (known after apply)
      + description         = "Fires every five minutes"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = "every-five-minutes"
      + schedule_expression = "rate(5 minutes)"
    }

  # module.aws-lambda-cost.aws_cloudwatch_event_target.check-aws-lambda-cost-every-five-minutes will be created
  + resource "aws_cloudwatch_event_target" "check-aws-lambda-cost-every-five-minutes" {
      + arn       = "arn:aws:lambda:us-east-1:589845989135:function:aws-lambda-cost"
      + id        = (known after apply)
      + rule      = "every-five-minutes"
      + target_id = "aws-lambda-cost"
    }

  # module.aws-lambda-cost.aws_lambda_permission.allow-cloudwatch-to-call-check-foo will be created
  + resource "aws_lambda_permission" "allow-cloudwatch-to-call-check-foo" {
      + action        = "lambda:InvokeFunction"
      + function_name = "aws-lambda-cost"
      + id            = (known after apply)
      + principal     = "events.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowExecutionFromCloudWatch"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
